//1为墙，0为初始化区域，2为箱子，
//3为终点，4为人，5为可走区域;
extern int map1[6][9]=
{
    0,0,1,1,1,1,0,0,0,
    1,1,1,5,5,1,1,1,1,
    1,5,5,5,5,5,2,5,1,
    1,5,1,5,5,1,2,5,1,
    1,5,3,5,3,1,4,5,1,
    1,1,1,1,1,1,1,1,1
};
extern int num_flags_map1 = 2;
extern int length_of_map1 = 9;
extern int width_of_map1 = 6;

extern int map2[8][12]=
{
    0,0,0,1,1,1,1,1,0,0,0,0,
    1,1,1,1,5,5,5,1,0,0,0,0,
    1,3,3,1,2,2,5,1,0,0,0,0,
    1,5,3,3,2,5,5,1,1,1,1,1,
    1,5,4,1,5,1,5,1,5,5,5,1,
    1,5,5,2,5,5,5,5,5,2,5,1,
    1,5,5,1,1,1,1,1,1,1,3,1,
    1,1,1,1,0,0,0,0,0,1,1,1
};
extern int num_flags_map2 = 4;
extern int length_of_map2 = 12;
extern int width_of_map2 = 8;

extern int map3[11][11] = 
{
    0,0,0,1,1,1,0,0,0,0,0,
    0,0,1,1,5,1,0,1,1,1,1,
    0,1,1,5,5,1,1,1,5,5,1,
    1,1,5,2,5,5,5,5,5,5,1,
    1,5,5,5,4,2,5,1,5,5,1,
    1,1,1,5,2,1,1,1,5,5,1,
    0,0,1,5,5,1,3,3,5,5,1,
    0,1,1,5,1,1,3,1,5,1,1,
    0,1,5,5,5,5,5,5,1,1,0,
    0,1,5,5,5,5,5,1,1,0,0,
    0,1,1,1,1,1,1,1,0,0,0
};
extern int num_flags_map3 = 3;
extern int length_of_map3 = 11;
extern int width_of_map3 = 11;

extern int map4[1][4] = 
{
    4,2,5,3
};
extern int num_flags_map4 = 1;
extern int length_of_map4 = 1;
extern int width_of_map4 = 4;